non-reacting/LES/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

/*

Setup for simulation of Volvo flygmotor AB non-reacting flow LES

Nicholas Curtis - 04/05/2018

*/


// use same settings for both non-reacting & reacting simulations per Cocks et al.
application     reactingFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

// ~ equivalent to 4 residence times
endTime         0.2;

// non-reacting time-step from Cocks et al.
deltaT          1e-6;

// output -- mostly pulled from combustion/reactingFoam/RAS/SandiaD_LTS tutorial
writeControl    timeStep;
writeInterval   100;
purgeWrite      0;
writeFormat     binary;
writePrecision  10;
writeCompression no;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
