non-reacting/LES/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
/*

 turbulenceProperties for non-reacting volvo flygmotor AB

 Nick Curtis -- 04/12/18

*/

simulationType   LES;

LES
{
    LESModel        Smagorinsky;
    delta			cubeRootVol;
    printCoeffs		on;
    turbulence      on;

    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }

}

// ************************************************************************* //
