non-reacting/LES/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}

/*

 thermophysicalProperties for non-reacting volvo flygmotor AB

 Nick Curtis -- 04/12/18

*/

thermoType
{
    type            hePsiThermo;
    mixture         reactingMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

inertSpecie N2;
fuel        C2H4;

chemistryReader chemkinReader;
CHEMKINFile "$FOAM_CASE/chemkin/grimech30.dat";
CHEMKINThermoFile "$FOAM_CASE/chemkin/thermo30.dat";
// annoyingly, openfoam doesn't support a chemkin/cantera-like transport model
//CHEMKINTransportFile "$FOAM_CASE/chemkin/ucsdtrans.dat";

// ************************************************************************* //
