non-reacting/LES/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Based on suggestions from MVP2:
// https://community.apan.org/cfs-file/__key/widgetcontainerfiles/3fc3f82483d14ec485ef92e206116d49-g-_2D00_tM6tEO4PkenM5KsnY8ctg-page-0cases/MVP2_5F00_Validation_5F00_Case_5F00_Final.pdf

dimensions      [0 1 -1 0 0 0 0];

// MVP uses a fixed mass flow rate of 0.2079 kg/s -- but this doesn't give consistent
// answers w/ their other BC's (see inlet_calculator.py)
// Wu used 16.6 for non-reacting & 17.3 for reacting
// cocks uses 17 m/s for all cases
internalField   uniform 16.6;

boundaryField
{
	top_wall
	{
		type 			noSlip;
	}
    bottom_wall
    {
    	type            noSlip;
    }
    bluff_body
    {
        type            noSlip;
    }
    left_wall
    {
        type            symmetryPlane;
    }
    right_wall
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            fixedValue;
        value           $internalField;

    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
