non-reacting/LES/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

/*

Setup for simulation of Volvo flygmotor AB non-reacting flow LES

Nicholas Curtis - 04/10/2018

Based on:

Cocks et al: https://arc.aiaa.org/doi/abs/10.2514/6.2013-170
Wolf: http://www.wolfdynamics.com/wiki/OFtipsandtricks.pdf
Manual: https://cfd.direct/openfoam/user-guide/fvSolution/
PRM: https://github.com/ParticulateFlow/OSCCAR-doc/blob/master/openFoamUserManual_PFM.pdf

*/

solvers
{
	// PISO solver from wolf, pages 56-57
    p
	{
		solver GAMG;
		// Wolf: may want 1e-5 / 1e-2 for startup
		tolerance 1e-5
		relTol 0.05;
		smoother GaussSeidel;
		nPreSweeps 0;
		nPostSweeps 2;
		cacheAgglomeration on;
		agglomerator faceAreaPair;
		nCellsInCoarsestLevel 1000;
		mergeLevels 1;
	}
	pFinal
	{
		solver GAMG;
		tolerance 1e-06;
		relTol 0.0;
		smoother GaussSeidel;
		nPreSweeps 0;
		nPostSweeps 2;
		cacheAgglomeration on;
		agglomerator faceAreaPair;
		nCellsInCoarsestLevel 1000;
		mergeLevels 1;
	}

    "(U|Yi|h)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        // from fireFoam LES example -- relTol bumped down to 0.05 from 0.01
		tolerance       1e-6;
        relTol          0.05;
        nSweeps         1;
    };

    "(U|Yi|h)Final"
    {
        $U;
        relTol          0.0;
    };
}

PIMPLE
{
	// manual - PISO, SIMPLE and PIMPLE algorithms
	// neither low RE nor multi-phase
    momentumPredictor yes;
    nOuterCorrectors  1;
    nCorrectors       2;
    // wolf p.g., 43
	nNonOrthogonalCorrectors 1;
	maxDeltaT		  1e-6;
}
